# 2. Напишите программу для. проверки истинности утверждения ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z 
# для всех значений предикат.
a = [1,1,1,1,0,0,0,0]
b = [1,1,0,0,1,1,0,0]
c = [1,0,1,0,1,0,1,0]
for i in range(8):
    print(f'X = {a[i]},', f'Y = {b[i]},', f'Z = {c[i]}', end=' ')
    print(not(a[i] or b[i] or c[i]) == (not(a[i]) and not(b[i]) and not(c[i])))
# X   Y   Z   ¬X   ¬Y  ¬Z    (X ⋁ Y ⋁ Z)    ¬(X ⋁ Y ⋁ Z)    ¬X ⋀ ¬Y ⋀ ¬Z    ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z 
# 1   1   1    0   0   0           1               0                0                       1
# 1   1   0    0   0   1           1               0                0                       1
# 1   0   1    0   1   0           1               0                0                       1
# 1   0   0    0   1   1           1               0                0                       1
# 0   1   1    1   0   0           1               0                0                       1
# 0   1   0    1   0   1           1               0                0                       1
# 0   0   1    1   1   0           1               0                0                       1
# 0   0   0    1   1   1           0               1                1                       1